In [206]:
import pandas as pd

In [207]:
data = pd.read_csv("./Year_Released Title and Metacritic Rating.csv")
imdb_db = pd.read_csv('./imdb_db.csv')

In [208]:
imdb_db = imdb_db[['primaryTitle','averageRating','startYear']]
imdb_db = pd.DataFrame(imdb_db)
imdb_db.columns = ['Title','Imdb Rating','Year']

In [209]:
data.head()

   Unnamed: 0  Unnamed: 0.1          Title  Year  Metacritic Rating
0           0             0   Citizen Kane  1941                100
1           1             1  The Godfather  1972                100
2           2             2    Rear Window  1954                100
3           3             3     Casablanca  1943                100
4           4             4        Boyhood  2014                100

In [210]:
data_1plus = data.loc[data_1plus['Year'] != 'TBA']
data_1plus['Year'] = data_1plus['Year'].astype(int)
data_1plus['Year'] = data_1plus['Year'] + 1
data_1plus.head()

   Unnamed: 0  Unnamed: 0.1          Title  Year  Metacritic Rating
0           0             0   Citizen Kane  1942                100
1           1             1  The Godfather  1973                100
2           2             2    Rear Window  1955                100
3           3             3     Casablanca  1944                100
4           4             4        Boyhood  2015                100

In [211]:
combined_1plus = pd.merge(data_1plus,imdb_db,how='inner',on = ('Title','Year'))

In [212]:
combined_1plus

,Unnamed: 0,Unnamed: 0.1,Title,Year,Metacritic Rating,Imdb Rating
0,425,425,Boys Don't Cry,2000,90,7.6
1,595,595,The Circle,2002,88,5.0
2,698,698,Together,2002,87,7.4

In [213]:
data_2plus = data.loc[data['Year'] != 'TBA']
data_2plus['Year'] = data_2plus['Year'].astype(int)
data_2plus['Year'] = data_2plus['Year'] + 2
data_2plus.head()

   Unnamed: 0  Unnamed: 0.1          Title  Year  Metacritic Rating
0           0             0   Citizen Kane  1943                100
1           1             1  The Godfather  1974                100
2           2             2    Rear Window  1956                100
3           3             3     Casablanca  1945                100
4           4             4        Boyhood  2016                100

In [214]:
combined_2plus = pd.merge(data_2plus,imdb_db,how='inner',on = ('Title','Year'))

In [215]:
combined_2plus

   Unnamed: 0  Unnamed: 0.1        Title  Year  Metacritic Rating  Imdb Rating
0          61            61  Taxi Driver  1978                 96          5.4
1         595           595   The Circle  2003                 88          5.0
2         919           919   The Return  2006                 86          4.8

In [216]:
data_1minus = data.loc[data['Year'] != 'TBA']
data_1minus['Year'] = data_1minus['Year'].astype(int)
data_1minus['Year'] = data_1minus['Year'] - 1

In [217]:
combined_1minus = pd.merge(data_1minus,imdb_db,how='inner',on = ('Title','Year'))

In [218]:
combined_1minus.count()

Unnamed: 0           97
Unnamed: 0.1         97
Title                97
Year                 97
Metacritic Rating    97
Imdb Rating          97
dtype: int64

In [219]:
data4 = data.loc[data['Year'] != 'TBA']
data4['Year'] = data4['Year'].astype(int)
data4['Year'] = data4['Year'] - 2

In [220]:
combined4 = pd.merge(data4,imdb_db,how='inner',on = ('Title','Year'))

In [221]:
combined4.count()

Unnamed: 0           13
Unnamed: 0.1         13
Title                13
Year                 13
Metacritic Rating    13
Imdb Rating          13
dtype: int64

In [222]:
data_3minus = data.loc[data['Year'] != 'TBA']
data_3minus['Year'] = data_3minus['Year'].astype(int)
data_3minus['Year'] = data_3minus['Year'] - 3

In [223]:
combined_3minus = pd.merge(data_3minus,imdb_db,how='inner',on = ('Title','Year'))

In [224]:
combined_3minus

   Unnamed: 0  Unnamed: 0.1        Title  Year  Metacritic Rating  Imdb Rating
0          61            61  Taxi Driver  1973                 96          6.4
1         568           568   Cinderella  1947                 88          7.7
2         762           762   Taxidermia  2006                 87          7.0